// let p = 10;
// for (let i = 1; i <= 20; i++) {
//   const b = i % 4;
//   if (b == 0) {
//     console.log(i);
//   }
// }
// console.log(b);

// ------------------------------------------
// برنامه‌ای بنویس که روز اول ۱۰ هزار تومان پول داشته باشی و هر
// روز ۱۰ هزار تومان بهش اضافه بشه.موجودی رو برای ۷ روز چاپ کن.

// let a = 10;
// for (let v = 0; v < 7; v++) {
//   a = a + 10;
// }
// console.log(a);

// جان بازیکن اول کار 100
// بیست  تا ضربه میخوره
// هر ضربه 2 تا جون ازش میگیره

// let y = 100;
// for (let o = 0; o < 20; o++) {
//   y = y - 2;
// }
// console.log(y);

// const n = [23, 4, 54, 2, 12, 54, 6, 5, 4, 84, 21, 34];
// const m = [];

// for (let z = 0; z < n.length; z++) {
//   let p = n[z] / 2;
//   m.push(p);
// }

// console.log(m);

// const m = [
//   42, 7, 91, 15, 63, 28, 4, 76, 33, 58, 12, 99, 21, 67, 38, 5, 84, 49, 73, 30,
// ];

// از لیست بالا بیاید ان هایی که کمتر از 5 هستن را پرینت کنید
// let k = [];

// for (let q = 0; q < m.length; q++) {
//   if (m[q] < 15) {
//     k.push(m[q]);
//   }
// }
// console.log(k);
